# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.

num = int(input('Введите целое число '))



# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.

a = int(input('Введите число 1: '))
b = int(input('Введите число 2: '))

print("a= ",a,"b= ",b)


# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида ax2 + bx + c = 0.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math
# import math
# math.sqrt(4) - вычисляет корень числа 4
